# SQL Assignment

## Imports

In [1]:
import pandas as pd
import sqlite3, os
from IPython.display import display, HTML

In [2]:
os.getcwd()

'/home/parth/AppliedAI/assignments/18 SQL Assignment on IMDB data'

In [3]:
conn = sqlite3.connect("Db-IMDB-Assignment.db",  check_same_thread=False)

## Overview of all tables

In [4]:
tables = pd.read_sql_query("SELECT NAME AS 'Table_Name' FROM sqlite_master WHERE type='table'",conn)
tables = tables["Table_Name"].values.tolist()

In [5]:
for table in tables:
    query = "PRAGMA TABLE_INFO({})".format(table)
    schema = pd.read_sql_query(query,conn)
    print("Schema of",table)
    display(schema)
    print("-"*100)
    print("\n")

Schema of Movie

   cid       name     type  notnull dflt_value  pk
0    0      index  INTEGER        0       None   0
1    1        MID     TEXT        0       None   0
2    2      title     TEXT        0       None   0
3    3       year     TEXT        0       None   0
4    4     rating     REAL        0       None   0
5    5  num_votes  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Genre

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    GID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Language

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2   LAID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Country

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    CID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Location

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    LID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Location

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    LID     REAL        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Country

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    CID     REAL        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Language

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2   LAID  INTEGER        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Genre

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    GID  INTEGER        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Person

   cid    name     type  notnull dflt_value  pk
0    0   index  INTEGER        0       None   0
1    1     PID     TEXT        0       None   0
2    2    Name     TEXT        0       None   0
3    3  Gender     TEXT        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Producer

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Director

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Cast

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------

## Useful tips:

1. the year column in 'Movie' table, will have few chracters other than numbers which you need to be preprocessed, you need to get a substring of last 4 characters, its better if you convert it as int type, ex: CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER)

2. For almost all the TEXT columns we have show, please try to remove trailing spaces, you need to use TRIM() function

3. When you are doing count(coulmn) it won't consider the "NULL" values, you might need to explore other alternatives like Count(*)

## Questions

### Q1 --- List all the directors who directed a 'Comedy' movie in a leap year. (You need to check that the genre is 'Comedy’ and year is a leap year) Your query should return director name, the movie name, and the year.

**Hint**

To determine whether a year is a leap year, follow these steps:

<ul>
    <li><b>STEP-1:</b> If the year is evenly divisible by 4, go to step 2. Otherwise, go to step 5.</li>
    <li><b>STEP-2:</b> If the year is evenly divisible by 100, go to step 3. Otherwise, go to step 4.</li>
    <li><b>STEP-3:</b> If the year is evenly divisible by 400, go to step 4. Otherwise, go to step 5.</li>
    <li><b>STEP-4:</b> The year is a leap year (it has 366 days).</li>
    <li><b>STEP-5:</b> The year is not a leap year (it has 365 days).</li>
</ul>

Year 1900 is divisible by 4 and 100 but it is not divisible by 400, so it is not a leap year.

In [6]:
%%time
def grader_1(q1):
    q1_results  = pd.read_sql_query(q1,conn)
    print(q1_results.head(10))
    assert (q1_results.shape == (232,3))

query1 = """ 
with  genre_table AS (
  SELECT
    mid
  FROM M_GENRE mg
  JOIN (
    SELECT 
      gid 
    FROM GENRE
    WHERE LOWER(name) LIKE '%comedy%'
  ) g
  ON g.gid = mg.gid
),
movie_table AS ( 
  SELECT 
    m.mid,
    TRIM(title) movie_name,
    CAST(SUBSTR(TRIM(year),-4) AS INTEGER) as year
  FROM MOVIE m
  JOIN genre_table gt 
  ON gt.mid = m.mid
  WHERE (
  CAST(SUBSTR(TRIM(year),-4) AS INTEGER) % 4 = 0 OR (CAST(SUBSTR(TRIM(year),-4) AS INTEGER) % 100 = 0 
  OR CAST(SUBSTR(TRIM(year),-4) AS INTEGER) % 400 = 0 
)
      )
)
SELECT
  UPPER(p.name) AS Name,
  UPPER(mt.movie_name) AS Movie_Name,
  mt.year as Year
FROM movie_table mt
JOIN M_Director md
ON md.mid = mt.mid
JOIN PERSON p 
ON p.pid=md.pid
"""
grader_1(query1)

                Name                         Movie_Name  Year
0       MILAP ZAVERI                         MASTIZAADE  2016
1       DANNY LEINER  HAROLD & KUMAR GO TO WHITE CASTLE  2004
2     ANURAG KASHYAP                 GANGS OF WASSEYPUR  2012
3       FRANK CORACI        AROUND THE WORLD IN 80 DAYS  2004
4      GRIFFIN DUNNE             THE ACCIDENTAL HUSBAND  2008
5        ANURAG BASU                             BARFI!  2012
6    GURINDER CHADHA                  BRIDE & PREJUDICE  2004
7         MIKE JUDGE    BEAVIS AND BUTT-HEAD DO AMERICA  1996
8   TARUN MANSUKHANI                            DOSTANA  2008
9       SHAKUN BATRA                      KAPOOR & SONS  2016
CPU times: user 62.3 ms, sys: 7.01 ms, total: 69.3 ms
Wall time: 73.6 ms

### Q2 --- List the names of all the actors who played in the movie 'Anand' (1971)

In [7]:
%%time
def grader_2(q2):
    q2_results  = pd.read_sql_query(q2,conn)
    print(q2_results.head(10))
    assert (q2_results.shape == (17,1))


query2 = """ 
SELECT
    UPPER(p.name)
FROM MOVIE m
JOIN M_CAST mc
ON m.mid = mc.mid
JOIN PERSON p
ON TRIM(mc.pid)  =TRIM(p.pid)
WHERE LOWER(TRIM(m.title)) = 'anand'
  AND CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER) = 1971

"""
grader_2(query2)

       UPPER(p.name)
0   AMITABH BACHCHAN
1      RAJESH KHANNA
2      SUMITA SANYAL
3         RAMESH DEO
4          SEEMA DEO
5     ASIT KUMAR SEN
6         DEV KISHAN
7       ATAM PRAKASH
8      LALITA KUMARI
9             SAVITA
CPU times: user 312 ms, sys: 3.57 ms, total: 316 ms
Wall time: 314 ms

### Q3 --- List all the actors who acted in a film before 1970 and in a film after 1990. (That is: < 1970 and > 1990.)

In [8]:
%%time

def grader_3a(query_less_1970, query_more_1990):
    q3_a = pd.read_sql_query(query_less_1970,conn)
    q3_b = pd.read_sql_query(query_more_1990,conn)
    print(q3_a.shape, q3_b.shape)
    return (q3_a.shape == (4942,1)) and (q3_b.shape == (62570,1))

query_less_1970 =""" 
SELECT
    LOWER(TRIM(p.name)) name
FROM M_CAST mc
JOIN MOVIE m
ON m.mid = mc.mid
JOIN PERSON p
ON TRIM(mc.pid)  =TRIM(p.pid)
WHERE CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER) < 1970
 """
query_more_1990 =""" SELECT
     LOWER(TRIM(p.name)) name
FROM MOVIE m
JOIN M_CAST mc
ON m.mid = mc.mid
JOIN PERSON p
ON TRIM(mc.pid)  =TRIM(p.pid)
WHERE CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER) > 1990
 """
print(grader_3a(query_less_1970, query_more_1990))

# using the above two queries, you can find the answer to the given question

(4942, 1) (62570, 1)
True
CPU times: user 7min 40s, sys: 49.8 ms, total: 7min 40s
Wall time: 7min 41s

In [9]:
%%time
def grader_3(q3):
    q3_results  = pd.read_sql_query(q3,conn)
    print(q3_results.head(10))
    print(q3_results.shape)
    assert (q3_results.shape == (300,1))

query3 ="""
with table1 as (
    SELECT
        LOWER(TRIM(p.name)) name,
        TRIM(p.pid) pid
    FROM M_CAST mc
    JOIN MOVIE m ON m.mid = mc.mid
    JOIN PERSON p ON TRIM(mc.pid)  =TRIM(p.pid)
    WHERE CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER) < 1970
    limit 100000
),
table2 as (
    SELECT
     LOWER(TRIM(p.name)) name,
     TRIM(p.pid) pid
    FROM MOVIE m
    JOIN M_CAST mc ON m.mid = mc.mid
    JOIN PERSON p  ON TRIM(mc.pid)  =TRIM(p.pid)
    WHERE CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER) > 1990
    limit 100000
)

 select
    distinct t1.name 
 from table1 as t1 
 join table2  t2 on TRIM(t1.pid) = TRIM(t2.pid) 
 --limit 1000
"""

#  """ 
# WITH temp_table AS (
# SELECT
#      LOWER(TRIM(p.name)) name,
#     CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER) year
# FROM MOVIE m
# JOIN M_CAST mc
# ON m.mid = mc.mid
# JOIN PERSON p
# ON TRIM(mc.pid)  =TRIM(p.pid)
# WHERE CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER) < 1970 OR CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER) > 1990
# )

# SELECT  name 
# FROM temp_table
# WHERE year < 1970
#  and name in 
#     (
#     SELECT  name 
# FROM temp_table
# WHERE year > 1990
#     )

#  """
grader_3(query3)

             name
0  waheeda rehman
1   johnny walker
2         mehmood
3           ratna
4    lalita pawar
5  achala sachdev
6        iftekhar
7  rajendra kumar
8       raj mehra
9      sunil dutt
(300, 1)
CPU times: user 7min 44s, sys: 316 ms, total: 7min 45s
Wall time: 7min 45s

### Q4 --- List all directors who directed 10 movies or more, in descending order of the number of movies they directed. Return the directors' names and the number of movies each of them directed.

In [10]:
%%time

def grader_4a(query_4a):
    query_4a = pd.read_sql_query(query_4a,conn)
    print(query_4a.head(10))
    print(query_4a.shape) 
    return (query_4a.shape == (1462,2))

query_4a =""" 
SELECT 
    p.name Director_Name , 
    count(md.mid) Movie_Count
FROM person p
JOIN m_director md ON lower(trim(p.pid)) = lower(trim(md.pid))
GROUP BY Director_Name
ORDER BY Movie_Count DESC"""
print(grader_4a(query_4a))

# using the above query, you can write the answer to the given question

           Director_Name  Movie_Count
0           David Dhawan           39
1           Mahesh Bhatt           36
2           Priyadarshan           30
3        Ram Gopal Varma           30
4           Vikram Bhatt           29
5   Hrishikesh Mukherjee           27
6            Yash Chopra           21
7         Shakti Samanta           19
8        Basu Chatterjee           19
9           Subhash Ghai           18
(1457, 2)
False
CPU times: user 58.6 s, sys: 4 ms, total: 58.6 s
Wall time: 58.6 s

In [11]:
%%time
def grader_4(q4):
    q4_results  = pd.read_sql_query(q4,conn)
    print(q4_results.head(10))
    assert (q4_results.shape == (58,2))

query4 = """ 
SELECT p.name Director_Name , count(md.mid) Movie_Count
FROM person p
JOIN m_director md
ON p.pid = md.pid
GROUP BY Director_Name
HAVING Movie_Count >= 10
ORDER BY Movie_Count DESC
 """
grader_4(query4)

           Director_Name  Movie_Count
0           David Dhawan           39
1           Mahesh Bhatt           36
2           Priyadarshan           30
3        Ram Gopal Varma           30
4           Vikram Bhatt           29
5   Hrishikesh Mukherjee           27
6            Yash Chopra           21
7         Shakti Samanta           19
8        Basu Chatterjee           19
9           Subhash Ghai           18
CPU times: user 22.3 ms, sys: 0 ns, total: 22.3 ms
Wall time: 21.3 ms

### Q5

#### Q5.a --- For each year, count the number of movies in that year that had only female actors.

In [12]:
# %%time

# # note that you don't need TRIM for person table

# def grader_5aa(query_5aa):
#     query_5aa = pd.read_sql_query(query_5aa,conn)
#     print(query_5aa.head(10)) 
#     print(query_5aa.shape)
#     return (query_5aa.shape == (8846,3))

# # query_5aa =""" 
# # with temp_table AS (
# # """
# query_5aa = """
# SELECT  CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER) year, FEMALE_COUNT 
# FROM ( 
# SELECT MID, SUM(MALES) AS MALE_COUNT, SUM(FEMALES) AS FEMALE_COUNT
# FROM (
# SELECT 
#   MC.MID , 
#   (CASE WHEN LOWER(TRIM(P.GENDER )) ='male' THEN 1 ELSE 0 END) MALES,
#   (CASE WHEN LOWER(TRIM(P.GENDER )) ='female' THEN 1 ELSE 0 END) FEMALES
# FROM M_CAST MC
# JOIN PERSON P  ON  LOWER(TRIM(P.PID)) =  LOWER(TRIM(MC.PID))
# )
# GROUP BY 1
# ) a
# JOIN movie m on a.mid = m.mid
# WHERE MALE_COUNT = 0
# """

# print(grader_5aa(query_5aa))

# def grader_5ab(query_5ab):
#     query_5ab = pd.read_sql_query(query_5ab,conn)
#     print(query_5ab.head(10)) 
#     return (query_5ab.shape == (3469, 3))

# query_5ab =""" *** Write your query that will have at least one male actor try to use query that you have written above *** """

# print(grader_5ab(query_5ab))


# # using the above queries, you can write the answer to the given question

In [13]:
%%time
def grader_5a(q5a):
    q5a_results  = pd.read_sql_query(q5a,conn)
    print(q5a_results.head(100))
    assert (q5a_results.shape == (4,2))

query5a = """SELECT  CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER) year, FEMALE_COUNT 
FROM ( 
SELECT MID, SUM(MALES) AS MALE_COUNT, SUM(FEMALES) AS FEMALE_COUNT
FROM (
SELECT 
  MC.MID , 
  (CASE WHEN LOWER(TRIM(P.GENDER )) ='male' THEN 1 ELSE 0 END) MALES,
  (CASE WHEN LOWER(TRIM(P.GENDER )) ='female' THEN 1 ELSE 0 END) FEMALES
FROM M_CAST MC
JOIN PERSON P  ON  LOWER(TRIM(P.PID)) =  LOWER(TRIM(MC.PID))
)
GROUP BY 1
) a
JOIN movie m on a.mid = m.mid
WHERE MALE_COUNT = 0 """
grader_5a(query5a)

   year  FEMALE_COUNT
0  2018             2
1  2000            10
2  1999            11
3  1939             1
CPU times: user 25min 29s, sys: 60 ms, total: 25min 29s
Wall time: 25min 29s

#### Q5.b --- Now include a small change: report for each year the percentage of movies in that year with only female actors, and the total number of movies made that year. For example, one answer will be: 1990 31.81 13522 meaning that in 1990 there were 13,522 movies, and 31.81% had only female actors. You do not need to round your answer.

In [14]:
%%time
def grader_5b(q5b):
    q5b_results  = pd.read_sql_query(q5b,conn)
    print(q5b_results.head(10))
    assert (q5b_results.shape == (4,3))

query5b = """
SELECT year , female_count/movies_per_year, female_count
FROM(
 SELECT p.year, p.female_count, q.movies_per_year
FROM 
(SELECT  CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER) year, FEMALE_COUNT 
FROM ( 
SELECT MID, SUM(MALES) AS MALE_COUNT, SUM(FEMALES) AS FEMALE_COUNT
FROM (
SELECT 
  MC.MID , 
  (CASE WHEN LOWER(TRIM(P.GENDER )) ='male' THEN 1.0 ELSE 0 END) MALES,
  (CASE WHEN LOWER(TRIM(P.GENDER )) ='female' THEN 1.0 ELSE 0 END) FEMALES
FROM M_CAST MC
JOIN PERSON P  ON  LOWER(TRIM(P.PID)) =  LOWER(TRIM(MC.PID))
)
GROUP BY 1
) a
JOIN movie m on a.mid = m.mid
WHERE MALE_COUNT = 0
) p
JOIN
(
SELECT CAST(SUBSTR(TRIM(year),-4) AS INTEGER) year, count(*) movies_per_year
from movie group by 1
) q ON p.year = q.year
) """
grader_5b(query5b)

   year  female_count/movies_per_year  female_count
0  1939                      0.500000           1.0
1  1999                      0.166667          11.0
2  2000                      0.156250          10.0
3  2018                      0.019231           2.0
CPU times: user 24min 58s, sys: 76 ms, total: 24min 59s
Wall time: 24min 59s

### Q6 --- Find the film(s) with the largest cast. Return the movie title and the size of the cast. By "cast size" we mean the number of distinct actors that played in that movie: if an actor played multiple roles, or if it simply occurs multiple times in casts, we still count her/him only once.

In [15]:
%%time
def grader_6(q6):
    q6_results  = pd.read_sql_query(q6,conn)
    print(q6_results.head(10))
    assert (q6_results.shape == (3473, 2))

query6 = """ 
SELECT m.title, a.cast_size
FROM 
(
SELECT mid, count ( distinct (pid )) cast_size
FROM m_cast 
group by 1
) a
left join movie m ON a.mid = m.mid
order by a.cast_size desc
 """
grader_6(query6)

                        title  cast_size
0               Ocean's Eight        238
1                    Apaharan        233
2                        Gold        215
3             My Name Is Khan        213
4  Captain America: Civil War        191
5                    Geostorm        170
6                     Striker        165
7                        2012        154
8                      Pixels        144
9       Yamla Pagla Deewana 2        140
CPU times: user 59.2 ms, sys: 4 ms, total: 63.2 ms
Wall time: 62.2 ms

### Q7 --- A decade is a sequence of 10 consecutive years. 
**For example, say in your database you have movie information starting from 1931.**

**the first decade is 1931, 1932, ..., 1940,**

**the second decade is 1932, 1933, ..., 1941 and so on.**

**Find the decade D with the largest number of films and the total number of films in D.**

In [16]:
%%time
def grader_7a(q7a):
    q7a_results  = pd.read_sql_query(q7a,conn)
    print(q7a_results.head(10))
    print(q7a_results.shape)
    assert (q7a_results.shape == (78, 2))

query7a = """

select start || "-"  || end grp, count(*) count
from (
select CAST(SUBSTR(TRIM(year),-4) AS STRING) start, CAST(CAST(SUBSTR(TRIM(year),-4) AS INTEGER) + 9 AS STRING) end , CAST(SUBSTR(TRIM(year),-4) AS INTEGER) year

from movie
)
group by 1 
order by count desc
 """
grader_7a(query7a)

# using the above query, you can write the answer to the given question

         grp  count
0  2013-2022    136
1  2016-2025    129
2  2005-2014    129
3  2017-2026    126
4  2014-2023    126
5  2010-2019    125
6  2015-2024    119
7  2011-2020    116
8  2012-2021    110
9  2009-2018    109
(78, 2)
CPU times: user 9.25 ms, sys: 1e+03 ns, total: 9.25 ms
Wall time: 7.93 ms

In [17]:
%%time
def grader_7b(q7b):
    q7b_results  = pd.read_sql_query(q7b,conn)
    print(q7b_results.head(10))
    assert (q7b_results.shape == (713, 4))

query7b = """   
    *** 
    Write a query that will do joining of the above table(7a) with itself 
    such that you will join with only rows if the second tables year is <= current_year+9 and more than or equal current_year
    *** 
          """
grader_7b(query7b)
# if you see the below results the first movie year is less than 2nd movie year and 
# 2nd movie year is less or equal to the first movie year+9

# using the above query, you can write the answer to the given question

DatabaseError: Execution failed on sql '
    ***
    Write a query that will do joining of the above table(7a) with itself
    such that you will join with only rows if the second tables year is <= current_year+9 and more than or equal current_year
    ***
          ': near "*": syntax error

In [23]:
%%time
def grader_7(q7):
    q7_results  = pd.read_sql_query(q7,conn)
    print(q7_results.head(10))
    assert (q7_results.shape == (1, 2))

query7 = """ 
select start || "-"  || end grp, count(*) count
from (
select CAST(SUBSTR(TRIM(year),-4) AS STRING) start, CAST(CAST(SUBSTR(TRIM(year),-4) AS INTEGER) + 9 AS STRING) end , CAST(SUBSTR(TRIM(year),-4) AS INTEGER) year

from movie
)
group by 1 
order by count desc
limit 1
"""
grader_7(query7)
# if you check the output we are printinng all the year in that decade, its fine you can print 2008 or 2008-2017

         grp  count
0  2013-2022    136
CPU times: user 10.6 ms, sys: 0 ns, total: 10.6 ms
Wall time: 9.46 ms

### Q8 --- Find all the actors that made more movies with Yash Chopra than any other director.

In [4]:
%%time
def grader_8a(q8a):
    q8a_results  = pd.read_sql_query(q8a,conn)
    print(q8a_results.head(10))
    print(q8a_results.shape)
    assert (q8a_results.shape == (73408, 3))

query8a = """ 
select md.pid director, mc.pid actor, count(m.mid) as count
from Movie m 
join m_director md
on m.mid = md.mid
join m_cast mc
on mc.mid = m.mid
group by 1,2
order by 3 
"""
grader_8a(query8a)

# using the above query, you can write the answer to the given question

    director       actor  count
0  nm0000180   nm0000027      1
1  nm0000180   nm0001114      1
2  nm0000180   nm0001919      1
3  nm0000180   nm0006762      1
4  nm0000180   nm0030062      1
5  nm0000180   nm0038970      1
6  nm0000180   nm0051856      1
7  nm0000180   nm0085966      1
8  nm0000180   nm0097889      1
9  nm0000180   nm0125497      1
(73408, 3)
CPU times: user 323 ms, sys: 27.4 ms, total: 350 ms
Wall time: 351 ms

In [21]:
%%time

def grader_8(q8):
    q8_results  = pd.read_sql_query(q8,conn)
    print(q8_results.head(10
                         ))
    print(q8_results.shape)
    assert (q8_results.shape == (245, 2))

# Yash chopra nm0007181
query8 = """
with temp as (
select md.pid director, mc.pid actor, count(m.mid) as count
from Movie m 
join m_director md
on m.mid = md.mid
join m_cast mc
on mc.mid = m.mid
group by 1,2
),
temp2 as(
select actor, sum(count) num_movies
from temp 
where director = 'nm0007181'
group by actor
),
temp3 as (
select 
actor, sum(count) num_o_mov from temp
where actor in ( select actor from temp2 )
and director != 'nm0007181'
group by actor
)
select *
from temp2 t2
join temp3 t3 on t2.actor=t3.actor 
where t2.num_movies < t3.num_o_mov
"""
# with dir_tbl as (
#     select md.pid director, m.mid  ,p.name dir_name
#     from Movie m 
#     join m_director md
#         on m.mid = md.mid
#     join Person p
#         on p.pid = md.pid
# ),
# act_tbl as (
#     select mc.pid actor, m.mid
#     from Movie m 
#     join m_cast mc
#         on m.mid = mc.mid

# ),
# y_tbl as (
# select actor, count( a.mid) as count
# from act_tbl a
# join dir_tbl d
#     on a.mid = d.mid
# where lower(dir_name) like '%yash%'
# group by 1 
# order by count desc
# ),
# mv_cnt as(
#     select actor, count( a.mid) as count
#     from act_tbl a
#     join dir_tbl d
#         on a.mid = d.mid
#     where lower(dir_name) like '%yash%'
#     group by 1 
#     order by count desc
# )
# select  mv.count , y.count count_yash
# from  y_tbl y
# join  mv_cnt mv
#     on y.actor = mv.actor
# order by count_yash desc
# """
grader_8(query8)

        actor  num_movies       actor  num_o_mov
0   nm0000821           6   nm0000821        198
1   nm0002043           1   nm0002043         68
2   nm0004109           2   nm0004109        198
3   nm0004334           1   nm0004334         72
4   nm0004429           1   nm0004429        115
5   nm0004434           7   nm0004434         52
6   nm0004435           3   nm0004435         66
7   nm0004437           2   nm0004437         56
8   nm0004487           2   nm0004487         77
9   nm0004564           4   nm0004564         78
(295, 4)

AssertionError:

In [ ]:
q  = """
select name, pid 
from person where lower(trim(name)) like '%yash%'
and pid in ( )
"""

### Q9 --- The Shahrukh number of an actor is the length of the shortest path between the actor and Shahrukh Khan in the "co-acting" graph. That is, Shahrukh Khan has Shahrukh number 0; all actors who acted in the same film as Shahrukh have Shahrukh number 1; all actors who acted in the same film as some actor with Shahrukh number 1 have Shahrukh number 2, etc. Return all actors whose Shahrukh number is 2.

In [ ]:
%%time
def grader_9a(q9a):
    q9a_results  = pd.read_sql_query(q9a,conn)
    print(q9a_results.head(10))
    print(q9a_results.shape)
    assert (q9a_results.shape == (2382, 1))

query9a = """ 
-- All movies with shahrukh
with temp as (
    select
        distinct trim(m.mid) mid
    from movie m
    join m_cast mc on m.mid = mc.mid
    where lower(trim(pid)) = 'nm0451321'
),
-- all actors in the movies except shahrukh
temp2 as (
    select
        distinct trim(mc.pid) pid
    from temp t
    join m_cast mc on trim(t.mid) = trim(mc.mid)
    join person p on trim(p.pid)  = trim(mc.pid)
    where lower(trim(mc.pid)) != 'nm0451321'
),
temp3 as(
select
    distinct trim(mc.mid) mid
from m_cast mc
join temp2 as t on trim(mc.pid) = t.pid
where trim(mc.mid) not in ( select mid from temp )
)
-- selecting actors from that movies expect the ones
-- who worked with shahrukh
select 
    distinct pid
from m_cast mc
join temp3 t on trim(mc.mid) = trim(t.mid)
where trim(mc.pid) not in ( select pid from temp2 )
"""
grader_9a(query9a)
# using the above query, you can write the answer to the given question

# selecting actors who acted with srk (S1)
# selecting all movies where S1 actors acted, this forms S2 movies list
# selecting all actors who acted in S2 movies, this gives us S2 actors along with S1 actors
# removing S1 actors from the combined list of S1 & S2 actors, so that we get only S2 actors

In [15]:
%%time
def grader_9(q9):
    q9_results  = pd.read_sql_query(q9,conn)
    print(q9_results.head(10))
    print(q9_results.shape)
    assert (q9_results.shape == (25698, 1))
query9 = """ 
with temp as (
    select
        distinct trim(m.mid) mid
    from movie m
    join m_cast mc on m.mid = mc.mid
    where lower(trim(pid)) = 'nm0451321'
),
-- all actors in the movies except shahrukh
temp2 as (
    select
        distinct trim(mc.pid) pid
    from temp t
    join m_cast mc on trim(t.mid) = trim(mc.mid)
    join person p on trim(p.pid)  = trim(mc.pid)
    where lower(trim(mc.pid)) != 'nm0451321'
),
temp3 as(
select
    distinct trim(mc.mid) mid
from m_cast mc
join temp2 as t on trim(mc.pid) = t.pid
where trim(mc.mid) not in ( select mid from temp )
)
-- selecting actors from that movies expect the ones
-- who worked with shahrukh
select 
    distinct pid
from m_cast mc
join temp3 t on trim(mc.mid) = trim(t.mid)
where trim(mc.pid) not in ( select pid from temp2 )
"""
grader_9(query9)

          PID
0   nm2539953
1   nm0922035
2   nm0324658
3   nm0943079
4   nm0000218
5   nm0001394
6   nm0929654
7   nm3116102
8   nm3248891
9   nm2418809
(25698, 1)
CPU times: user 1min 14s, sys: 103 ms, total: 1min 14s
Wall time: 1min 14s